## Production: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
route53.tf
```
```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_route53_record.cds_website_A[&quot;digital.cdssandbox.xyz&quot;]`   |
|        | `aws_route53_record.cds_website_A[&quot;numerique.cdssandbox.xyz&quot;]` |
|        | `aws_wafv2_web_acl_logging_configuration.cds_website_waf`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.cds_website_A["digital.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cds_website_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "digital.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z2FDTNDATAQYW2"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1521nfitmrfqw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_record.cds_website_A["numerique.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cds_website_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "numerique.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z2FDTNDATAQYW2"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1drqcaw0n1gh3.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.cds_website_waf will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "cds_website_waf" {
      + id                      = (known after apply)
      + log_destination_configs = [
          + "arn:aws:firehose:us-east-1:521732289257:deliverystream/aws-waf-log-cds-website",
        ]
      + resource_arn            = "arn:aws:wafv2:us-east-1:521732289257:global/webacl/cds_website_waf/8cded49b-34e3-45ab-a44d-6cc1f4ec91d5"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.log_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
